---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.ConfusingSweepByElementsInDesignOption
source: html/3377aa3c-31b7-d7bd-652b-b26c9a3ea92c.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.ConfusingSweepByElementsInDesignOption Property

A sweep in the main model cannot be hosted by an element in a Design Option [--if you continue it will not be added to the design option set].

## Syntax (C#)
```csharp
public static FailureDefinitionId ConfusingSweepByElementsInDesignOption { get; }
```